lee35210/nRF52840_TWI_TCS34725/tcs34725/tcs34725.h
#ifndef TCS34725_H
#define TCS34725_H

#include "tcs34725_internal.h"
#include "nrf_twi_sensor.h"

/**
 * @brief Possible sensor addresses.
 */
#define TCS34725_ADDR 0x29

// Minimum nrf_twi_sensor message buffer size and nrf_twi_mngr queue length.
#define TCS34725_MIN_QUEUE_SIZE 20

/**
 * @brief Macro creating mlx90614 sensor instance.
 *
 * @param[in] _mlx90614_inst_name    Sensor instance name.
 * @param[in] _p_twi_sensor         Pointer to common TWI sensor instance.
 * @param[in] _sensor_address       Sensor base address.
 */
#define TCS34725_INSTANCE_DEF(_tcs34725_inst_name, _p_twi_sensor, _sensor_address)                \
    TCS34725_INTERNAL_INSTANCE_DEF(_tcs34725_inst_name, _p_twi_sensor, _sensor_address)


/*
- MLX9061 transfer struct
reg_data : save data reading from mlx90614 or be written in mlx90614 register.
pec : Packet Error Code
reg_addr : MLX90614 Register Address
*/
typedef struct
{
    uint8_t reg_data;
    uint8_t reg_addr;
} tcs34725_reg_data_t;

typedef struct
{
    uint16_t clear;
    uint16_t red;
    uint16_t green;
    uint16_t blue;
//    uint8_t reg_addr;
} tcs34725_color_data_t;

typedef struct
{
    uint16_t threshold_data;
    uint8_t reg_addr;
} tcs34725_threshold_data_t;

typedef struct{
    bool rgbc_interrupt;
    bool wait_enable;
    bool rgbc_enable;
    bool power_on;
}tcs34725_config_enable_t;

typedef enum
{
    TCS34725_OUT_OF_RANGE_0,
    TCS34725_OUT_OF_RANGE_1,
    TCS34725_OUT_OF_RANGE_2,
    TCS34725_OUT_OF_RANGE_3,
    TCS34725_OUT_OF_RANGE_5,
    TCS34725_OUT_OF_RANGE_10,
    TCS34725_OUT_OF_RANGE_15,
    TCS34725_OUT_OF_RANGE_20,
    TCS34725_OUT_OF_RANGE_25,
    TCS34725_OUT_OF_RANGE_30,
    TCS34725_OUT_OF_RANGE_35,
    TCS34725_OUT_OF_RANGE_40,
    TCS34725_OUT_OF_RANGE_45,
    TCS34725_OUT_OF_RANGE_50,
    TCS34725_OUT_OF_RANGE_55,
    TCS34725_OUT_OF_RANGE_60
}tcs34725_persistence_t;

typedef enum
{
    TCS34725_LIST_ENABLE=0x00,
    TCS34725_LIST_TIMING=0x01,
    TCS34725_LIST_WAIT_TIME=0x03,
    TCS34725_LIST_PERSISTENCE=0x0C,
    TCS34725_LIST_CONFIG=0x0D,
    TCS34725_LIST_CONTROL=0x0F,
    TCS34725_LIST_ID=0x12,
    TCS34725_LIST_STATUS=0x13,
}tcs34725_list_t;

typedef enum
{
    TCS34725_WAIT_LONG_DISABLE,
    TCS34725_WAIT_LONG_ENABLE
}tcs34725_wait_long_t;

typedef enum
{
    TCS34725_GAIN_x1,
    TCS34725_GAIN_x4,
    TCS34725_GAIN_x16,
    TCS34725_GAIN_x60
}tcs34725_gain_t;

/**
 * @brief Data callback prototype.
 *
 * @param[in] result      Result of operation (NRF_SUCCESS on success,
 *                        otherwise a relevant error code).
 * @param[in] p_raw_data  Pointer to raw sensor data structure.
 */
typedef void (* tcs34725_data_callback_t)(ret_code_t result, tcs34725_reg_data_t * p_raw_data);

typedef void (* tcs34725_rgbc_callback_t)(ret_code_t result, tcs34725_color_data_t * p_raw_data);



#endif // TCS34725_H
